; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-1-3-2)
	(:domain driverlog)
	(:objects
	driver1 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-1 - location
	p1-5 - location
	p1-6 - location
	p2-0 - location
	p3-1 - location
	p4-2 - location
	p4-3 - location
	p5-0 - location
	p5-2 - location
	p6-4 - location
	p6-5 - location
	)
	(:init
	(at driver1 s4)
	(at truck1 s6)
	(empty truck1)
	(at truck2 s5)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at package1 s6)
	(at package2 s1)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(link s0 s1)
	(link s1 s0)
	(link s0 s4)
	(link s4 s0)
	(link s0 s5)
	(link s5 s0)
	(link s0 s6)
	(link s6 s0)
	(link s1 s3)
	(link s3 s1)
	(link s1 s4)
	(link s4 s1)
	(link s1 s6)
	(link s6 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s4)
	(link s4 s2)
	(link s3 s2)
	(link s2 s3)
	(link s3 s4)
	(link s4 s3)
	(link s3 s5)
	(link s5 s3)
	(link s3 s6)
	(link s6 s3)
	(link s4 s5)
	(link s5 s4)
	(link s4 s6)
	(link s6 s4)
	(link s5 s6)
	(link s6 s5)
)
	(:goal (and
	(at truck1 s6)
	(at truck2 s3)
	(at truck3 s0)
	(at package1 s3)
	(at package2 s1)
	))


)

; plan
1. (walk driver1 s4 p4-2)
   deleted: (at driver1 s4)
   added: (at driver1 p4-2)
   goals met: 2 of 5
2. (walk driver1 p4-2 s2)
   deleted: (at driver1 p4-2)
   added: (at driver1 s2)
   goals met: 2 of 5
3. (walk driver1 s2 p5-2)
   deleted: (at driver1 s2)
   added: (at driver1 p5-2)
   goals met: 2 of 5
4. (walk driver1 p5-2 s5)
   deleted: (at driver1 p5-2)
   added: (at driver1 s5)
   goals met: 2 of 5
5. (board-truck driver1 truck2 s5)
   deleted: (at driver1 s5) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 2 of 5
6. (drive-truck truck2 s5 s6 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s6)
   goals met: 2 of 5
7. (load-truck package1 truck2 s6)
   deleted: (at package1 s6)
   added: (in package1 truck2)
   goals met: 2 of 5
8. (drive-truck truck2 s6 s3 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s3)
   goals met: 3 of 5
9. (disembark-truck driver1 truck2 s3)
   deleted: (driving driver1 truck2)
   added: (at driver1 s3) (empty truck2)
   goals met: 3 of 5
10. (unload-truck package1 truck2 s3)
   deleted: (in package1 truck2)
   added: (at package1 s3)
   goals met: 4 of 5
11. (walk driver1 s3 p3-1)
   deleted: (at driver1 s3)
   added: (at driver1 p3-1)
   goals met: 4 of 5
12. (walk driver1 p3-1 s1)
   deleted: (at driver1 p3-1)
   added: (at driver1 s1)
   goals met: 4 of 5
13. (board-truck driver1 truck3 s1)
   deleted: (at driver1 s1) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 4 of 5
14. (drive-truck truck3 s1 s0 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   goals met: 5 of 5
